{
  "personalInfo": {
    "name": "Ajeesh Nechully Gangadharan",
    "title": "Staff-Level Platform Engineer",
    "email": "ajeesh_dp@icloud.com",
    "phone": "0435964451",
    "phoneFormatted": "0435 964 451",
    "linkedin": "https://linkedin.com/in/ajeesh-ng"
  },
  "professionalSummary": "Staff-level Platform Engineer with over a decade of experience in architecting and leading the development of cutting-edge cloud and AI/ML platforms. Brings a visionary approach to designing resilient solutions and driving platform strategy with a strong emphasis on MLOps, AI governance, and automation. Proficient in leveraging AWS, Python, and Kubernetes to deliver scalable and compliant platforms that align seamlessly with business objectives, fostering innovation and excellence in technical leadership.",
  "skills": {
    "cloudInfrastructure": [
      "AWS Sagemaker",
      "AWS Bedrock",
      "EC2",
      "S3",
      "Lambda",
      "API Gateway",
      "DynamoDB",
      "IAM",
      "VPC",
      "EKS",
      "Kubernetes"
    ],
    "developmentAI": [
      "Python",
      "LangChain",
      "OpenAI",
      "MLOps",
      "Ollama"
    ],
    "devops": [
      "DevSecOps",
      "GitHub Actions",
      "Jenkins",
      "Terraform",
      "CloudFormation",
      "Docker"
    ]
  },
  "certifications": [
    {
      "title": "AWS Machine Learning Associate",
      "icon": "Shield",
      "color": "primary"
    },
    {
      "title": "AWS Developer Associate",
      "icon": "Shield",
      "color": "primary"
    },
    {
      "title": "Certified Kubernetes Application Developer",
      "icon": "CheckSquare",
      "color": "accent"
    },
    {
      "title": "AWS Cloud Practitioner",
      "icon": "Shield",
      "color": "primary"
    },
    {
      "title": "ITIL Foundation Certification",
      "icon": "FileText",
      "color": "secondary"
    }
  ],
  "employmentHistory": [
    {
      "title": "Senior Platform Engineer, MLOps - CDAO",
      "company": "Commonwealth Bank of Australia",
      "period": "Dec 2023 - Present",
      "location": "Sydney",
      "responsibilities": [
        "Designed, architected, and led the delivery of the Technical Model Registry platform — a centralized, enterprise-grade governance platform for all ML models at the bank backed by AWS Sagemaker, enabling secure lifecycle management, automated compliance, and full auditability.",
        "Built and integrated MCP servers to support agentic integration of Model Monitoring and Model Registry, ensuring seamless connectivity and automation across MLOps workflows.",
        "Engineered seamless integration of the registry with MLOps pipelines, enabling automated model registration, versioning, deployment tracking across development and production environments.",
        "Provided technical leadership and mentorship to engineers, driving adoption of best practices in model governance and responsible AI.",
        "Delivered advanced AI/ML monitoring capabilities using AWS Sagemaker, Step Functions, and Lambda, strengthening model oversight and operational resilience.",
        "Built and managed AWS EKS clusters, architecting scalable, highly available infrastructure for ML workloads and ensuring platform reliability.",
        "Led the design and deployment of cloud infrastructure for the Digital Human Hackathon, leveraging AWS and NVIDIA (CUDA, TOKIO) to support real-time AI workloads.",
        "Implemented robust CI/CD pipelines with GitHub Actions, automating deployments and reducing manual intervention."
      ]
    },
    {
      "title": "Technical Team Lead (DevOps/SRE) - Westpac Live - Digital",
      "company": "Tata Consultancy Services - Westpac Banking Corp.",
      "period": "Apr 2019 - Dec 2023",
      "location": "Sydney",
      "responsibilities": [
        "Led Westpac Online Banking operations team, ensuring exceptional application reliability, stability, and availability through strategic SRE implementation.",
        "Delivered 50% year-over-year reduction in incident volume by systematically resolving recurring high-impact issues.",
        "Eliminated 200+ hours of monthly manual tasks through comprehensive process automation initiatives.",
        "Achieved 35% reduction in incident and problem backlog within 12 months by implementing Site Reliability Engineering (SRE) best practices.",
        "Enhanced system observability by deploying and configuring enterprise monitoring solutions (AppDynamics, Splunk), significantly improving incident detection and response capabilities.",
        "Prevented critical AUSTRAC compliance breach by orchestrating emergency remediation within 24 hours of identification, ensuring regulatory adherence.",
        "Maintained exceptional 99.88% end-to-end application availability through proactive SRE methodology adoption.",
        "Recognition: Westpac Super Tech Individual Award recipient (Q1 2020, Q1 2021); CEO Recognition for AUSTRAC compliance emergency response leadership."
      ]
    },
    {
      "title": "System Engineer - Westpac Live - Digital",
      "company": "Tata Consultancy Services - Westpac Banking Corp.",
      "period": "Nov 2015 - Apr 2019",
      "location": "Chennai",
      "responsibilities": [
        "Maintained Westpac's online banking platform stability through comprehensive IT service management, including incident resolution, problem analysis, and change implementation.",
        "Streamlined operations by automating manual processes, reducing human intervention and eliminating error-prone tasks.",
        "Developed custom bash scripts to automate report generation and batch job failure recovery processes.",
        "Orchestrated seamless code deployments to production servers, including deployment coordination and pipeline automation implementation.",
        "Successfully executed critical production changes within designated maintenance windows, maintaining zero-downtime deployments.",
        "Delivered timely incident resolution by performing root cause analysis and implementing solutions within established SLA parameters."
      ]
    },
    {
      "title": "Software Developer Trainee",
      "company": "Tata Consultancy Services - Rolls Royce",
      "period": "Jun 2015 - Nov 2015",
      "location": "Trivandrum",
      "responsibilities": [
        "Developed interactive web apps with ASP.NET, enhancing user engagement and functionality.",
        "Created efficient database solutions with stored procedures, improving data retrieval speed.",
        "Implemented Selenium for testing, boosting application reliability and reducing bugs.",
        "Conducted code reviews, identifying and resolving issues, enhancing performance and stability.",
        "Participated in Agile processes, contributing to effective sprint planning and team collaboration."
      ]
    }
  ],
  "education": {
    "degree": "Bachelor of Engineering",
    "college": "SRM Valliammai Engineering College",
    "university": "Anna University",
    "location": "Chennai"
  }
}
